"""
回测图标
"""

# 绘制三角螺旋线
from mpl_toolkits import mplot3d

import matplotlib.pyplot as plt
import numpy as np

data = [
    [3, 0.03, 1104.07],
    [1, 0.04, 1099.62],
    [2, 0.04, 1094.45],
    [3, 0.04, 1093.68],
    [2, 0.03, 1093.43],
    [1, 0.03, 1090.78],
    [3, 0.02, 1085.47],
    [0, 0.04, 1077.92],
    [2, 0.02, 1073.28],
    [0, 0.03, 1063.45],
    [1, 0.02, 1056.35],
    [3, 0.01, 992.695],
    [0, 0.02, 991.245],
    [2, 0.01, 940.873],
    [1, 0.01, 888.161],
    [3, 0.007, 872.704],
    [2, 0.007, 829.4],
    [0, 0.01, 739.027],
    [1, 0.007, 732.838],
    [3, 0.005, 680.491],
    [2, 0.005, 637.72],
    [0, 0.007, 523.605],
    [1, 0.005, 497.33],
    [3, 0.004, 484.065],
    [2, 0.004, 429.678],
    [1, 0.004, 339.524],
    [0, 0.005, 274.993],
    [0, 0.004, 154.278],
]

fig = plt.figure()  # 定义新的三维坐标轴
ax = plt.axes(projection='3d')

# 三维散点的数据
xdata = []
ydata = []
zdata = []
for i in data:
    xdata.append(i[0])
    ydata.append(i[1])
    zdata.append(i[2])

ax.scatter3D(xdata, ydata, zdata, c=zdata, cmap='Blues')

# 作图
ax.plot_trisurf(xdata, ydata, zdata, cmap='rainbow')
plt.show()
